Revit 2027 API
BuiltInFailures.StairRampFailures.StairsWinderGenLayoutFailure Property
 Fail to generate run layout and then cannot make winder run
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsWinderGenLayoutFailure { get; }
Public Shared ReadOnly Property StairsWinderGenLayoutFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsWinderGenLayoutFailure {
	FailureDefinitionId^ get ();
}
static member StairsWinderGenLayoutFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace